INSERT INTO `node` (`id`, `name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
(1, 'SuperMarket', '超市管理系统', 1, '', 0, 0, 1),
(2, 'Index', '管理首页', 1, '后台首页', 0, 1, 2),
(3, 'Branch', '分店管理', 1, '', 0, 1, 2),
(4, 'Staff', '员工管理', 1, '', 0, 1, 2),
(5, 'Supplier', '供货商管理', 1, '', 0, 1, 2),
(6, 'Category', '商品分类管理', 1, '', 0, 1, 2),
(7, 'Goods', '商品信息管理', 1, '', 0, 1, 2),
(8, 'Promotions', '商品促销管理', 1, '', 0, 1, 2),
(9, 'StockRecord', '商品入库管理', 1, '', 0, 1, 2),
(10, 'SalesRecord', '商品销售管理', 1, '', 0, 1, 2),
(11, 'StockGoods', '商品入库', 1, '', 0, 1, 2),
(12, 'SaleGoods', '销售商品（前台）', 1, '销售人员所属的商品销售前台', 0, 1, 2),
(13, 'Node', '节点管理', 1, '', 0, 1, 2),
(14, 'Role', '角色管理', 1, '', 0, 1, 2),
(15, 'Member', '超市会员管理', 1, '', 0, 1, 2);



 /*******************************************
      后台首页相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '后台首页', 1, '', 0, 2, 3);



/*******************************************
      分店相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '分店列表', 1, '', 0, 3, 3),
('add', '增加分店', 1, '', 0, 3, 3),
('insert', '插入分店', 1, '', 0, 3, 3),
('edit', '编辑分店', 1, '', 0, 3, 3),
('update', '更新分店', 1, '', 0, 3, 3),
('del', '删除分店', 1, '', 0, 3, 3),
('recycle', '还原分店', 1, '', 0, 3, 3),
('goodsstock', '商品库存情况', 1, '', 0, 3, 3),
('stafflist', '分店的员工列表', 1, '', 0, 3, 3);



/*******************************************
      员工相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '员工列表', 1, '', 0, 4, 3),
('add', '增加', 1, '新员工信息录入', 0, 4, 3),
('insert', '插入', 1, '', 0, 4, 3),
('edit', '编辑', 1, '', 0, 4, 3),
('update', '更新', 1, '', 0, 4, 3),
('resetpwd', '密码重置', 1, '管理员可以无需旧密码进行密码重置', 0, 4, 3),
('checkAccount', '检测帐号是否可用', 1, '', 0, 4, 3),
('forbid', '禁用', 1, '', 0, 4, 3),
('resume', '恢复', 1, '', 0, 4, 3),
('del', '删除', 1, '', 0, 4, 3),
('recycle', '还原', 1, '', 0, 4, 3);


 /*******************************************
      供货商相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '供货商列表', 1, '', 0, 5, 3),
('searchgoods', '查看供应商提供的商品列表', 1, '', 0, 5, 3),
('goodscompare', '同一商品不同供货商进行比价', 1, '', 0, 5, 3),
('add', '增加', 1, '', 0, 5, 3),
('insert', '插入', 1, '', 0, 5, 3),
('edit', '编辑', 1, '', 0, 5, 3),
('update', '更新', 1, '', 0, 5, 3),
('del', '删除', 1, '', 0, 5, 3),
('recycle', '还原', 1, '', 0, 5, 3);



 /*******************************************
      商品分类相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '分类列表', 1, '', 0, 6, 3),
('sub_cate', '子分类列表', 1, '', 0, 6, 3),
('add', '增加', 1, '', 0, 6, 3),
('insert', '插入', 1, '', 0, 6, 3),
('edit', '编辑', 1, '', 0, 6, 3),
('update', '更新', 1, '', 0, 6, 3),
('del', '删除', 1, '', 0, 6, 3),
('recycle', '还原', 1, '', 0, 6, 3);


 /*******************************************
      商品相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '商品列表', 1, '', 0, 7, 3),
('search', '商品搜索', 1, '', 0, 7, 3),
('getInfo', '获取商品信息', 1, '', 0, 7, 3),
('checkBarcode', '检测条形码', 1, '用于在添加时检测条形码对应商品是否存在，如果存在，肯定不能添加', 0, 7, 3),
('add', '增加', 1, '', 0, 7, 3),
('insert', '插入', 1, '', 0, 7, 3),
('edit', '编辑', 1, '', 0, 7, 3),
('update', '更新', 1, '', 0, 7, 3),
('del', '删除', 1, '', 0, 7, 3),
('recycle', '还原', 1, '', 0, 7, 3);


 /*******************************************
      商品促销相关功能
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '促销商品列表', 1, '', 0, 8, 3),
('release', '发布促销', 1, '', 0, 8, 3),
('insert', '插入', 1, '', 0, 8, 3),
('edit', '编辑', 1, '', 0, 8, 3),
('update', '更新', 1, '', 0, 8, 3),
('del', '删除', 1, '', 0, 8, 3);


 /*******************************************
      入库管理相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '入库记录列表', 1, '', 0, 9, 3);

/*******************************************
      销售管理相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '销售记录列表', 1, '', 0, 10, 3),
('search', '搜索销售记录列表', 1, '', 0, 10, 3),
('showchart', '图表统计显示销售记录', 1, '', 0, 10, 3),
('showDetail', '销售记录详细', 1, '', 0, 10, 3);


 /*******************************************
      入库操作相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '入库首页', 1, '', 0, 11, 3),
('begin', '开始入库', 1, '', 0, 11, 3),
('showlist', '已录商品列表', 1, '', 0, 11, 3),
('pause', '暂停入库', 1, '', 0, 11, 3),
('cancel', '取消入库', 1, '', 0, 11, 3),
('addToList', '加入商品列表', 1, '', 0, 11, 3),
('getInfo', '获取商品信息', 1, '', 0, 11, 3),
('modify', '修改商品入库信息', 1, '修改入库清单中指定商品的信息', 0, 11, 3),
('del', '删除商品入库信息', 1, '删除入库清单中指定商品的信息', 0, 11, 3),
('doStock', '完成入库', 1, '', 0, 11, 3),
('history', '我的入库记录', 1, '可以查看入库人员自己的历史入库记录', 0, 11, 3),
('detail', '入库记录详细', 1, '查看指定入库记录的详细信息', 0, 11, 3);


/*******************************************
      销售操作相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '销售首页', 1, '', 0, 12, 3),
('begin', '开始销售', 1, '', 0, 12, 3),
('scan', '扫描条形码', 1, '', 0, 12, 3),
('showCart', '购物车商品清单', 1, '', 0, 12, 3),
('cancel', '取消销售', 1, '', 0, 12, 3),
('addToCart', '加入购物车', 1, '', 0, 12, 3),
('delFromCart', '从购物车删除商品', 1, '', 0, 12, 3),
('getInfo', '获取商品信息', 1, '', 0, 12, 3),
('doSale', '完成商品销售', 1, '', 0, 12, 3),
('showticket', '显示/打印小票信息', 1, '', 0, 12, 3),
('history', '售货员个人销售记录', 1, '', 0, 12, 3),
('detail', '售货员个人销售记录详细内容', 1, '', 0, 12, 3);

 /*******************************************
      系统节点相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '节点列表', 1, '', 0, 13, 3),
('add', '增加节点', 1, '', 0, 13, 3),
('insert', '插入节点', 1, '', 0, 13, 3),
('edit', '编辑节点', 1, '', 0, 13, 3),
('update', '更新节点', 1, '', 0, 13, 3),
('forbid', '禁用节点', 1, '', 0, 13, 3),
('resume', '恢复节点', 1, '', 0, 13, 3),
('del', '删除节点', 1, '', 0, 13, 3),
('recycle', '还原节点', 1, '', 0, 13, 3);


 /*******************************************
      系统角色相关
******************************************/
INSERT INTO `node` (`name`, `title`, `status`, `remark`, `sort`, `pid`, `level`) VALUES
('index', '角色列表', 1, '', 0, 14, 3),
('add', '增加角色', 1, '', 0, 14, 3),
('insert', '插入角色', 1, '', 0, 14, 3),
('edit', '编辑角色', 1, '', 0, 14, 3),
('update', '更新角色', 1, '', 0, 14, 3),
('forbid', '禁用角色', 1, '', 0, 14, 3),
('resume', '恢复角色', 1, '', 0, 14, 3),
('del', '删除角色', 1, '', 0, 14, 3),
('recycle', '还原角色', 1, '', 0, 14, 3),
('staff', '查看该角色下的员工列表', 1, '', 0, 14, 3),
('auth', '对角色的权限进行详细设置', 1, '', 0, 14, 3),
('updateAccess', '更新角色的权限信息', 1, '', 0, 14, 3);